BaseConfiguration/Money_2_0/Enums/ВидыТранспортаСообщенийОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыТранспортаСообщенийОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>EMAIL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FILE</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FTP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>COM</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексДиск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Dropbox</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GoogleDrive</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WSПассивныйРежим</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешняяСистема</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

BaseConfiguration/Money_2_0/Catalogs/СценарииОбменовДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СценарииОбменовДанными</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьРегламентноеЗадание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗаданиеGUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортОбменаДанными</Name>
					<Comment>Если заполнено, сценарий выполняется для транспорта, а не для узлов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортыОбменаДанными</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиОбмена</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УзелИнформационнойБазы</Name>
							<Type>
								<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТранспортаОбмена</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТранспортаСообщенийОбмена</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыполняемоеДействие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДействияПриОбмене</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

BaseConfiguration/Money_2_0/CommonModules/СинхронизацияАвтономныхКопийПовтИсп/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////


#Область СлужебныйПрограммныйИнтерфейс

Функция УзелЦентральнойБазы(ИмяПланаОбмена = "СинхронизацияАвтономныхКопий") Экспорт

	Результат = Неопределено;
	МенеджерПланаОбмена = ПланыОбмена[ИмяПланаОбмена];
	Если ЭтоЦентральнаяБаза() Тогда
		
		Результат = МенеджерПланаОбмена.ЭтотУзел();
		Если СтрДлина(СокрП(Результат.Код)) < 30 И Результат.Код <> "000" Тогда
			// код "000" может быть заменен на код из пакета обмена
			СинхронизацияАвтономныхКопийВызовСервера.ОбновитьИнформациюЭтогоУзла(Результат, НСтр("ru='Центральная база'"));
		КонецЕсли;
		
	Иначе
		
		Если ОбщегоНазначения.ПодсистемаСуществует("ФункционалКонфигурацииДеньги.ДеньгиВОблаке") Тогда
			МодульОбмена = ОбщегоНазначения.ОбщийМодуль("ДеньгиОбменСЦентральнойБазой");
			Результат = МодульОбмена.ПроверитьСоздатьУзелЦентральнойБазы();
		КонецЕсли;
		
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция ЭтоЦентральнаяБаза() Экспорт
	
	Возврат ОбщегоНазначения.РазделениеВключено() 
		Или ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения() = "ЦентрМобильных";
	
КонецФункции

Функция ЭтоАвтономнаяКопия() Экспорт
	
	Возврат Не ОбщегоНазначения.РазделениеВключено() 
		И ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения() = "КлиентОблака";
	
КонецФункции

Функция ПараметрыОбменаСУзлом(УзелКорреспондента, ДляЗаписиВJSON = Ложь) Экспорт
	Возврат СинхронизацияАвтономныхКопий.ПараметрыОбменаСУзлом(УзелКорреспондента, ДляЗаписиВJSON);	
КонецФункции

Функция СценарийОбменаДаннымиСЦентральнойБазой(УзелЦБ = Неопределено) Экспорт
	
	Результат = Справочники.СценарииОбменовДанными.ПустаяСсылка();
	
	Если Не ЗначениеЗаполнено(УзелЦБ) Тогда
		УзелЦБ = СинхронизацияАвтономныхКопийВызовСервера.УзелЦентральнойБазы();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(УзелЦБ) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("УзелЦБ", УзелЦБ);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СценарииОбменовДаннымиНастройкиОбмена.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СценарииОбменовДанными.НастройкиОбмена КАК СценарииОбменовДаннымиНастройкиОбмена
	|ГДЕ
	|	СценарииОбменовДаннымиНастройкиОбмена.УзелИнформационнойБазы = &УзелЦБ
	|	И СценарииОбменовДаннымиНастройкиОбмена.ВидТранспортаОбмена = Значение(Перечисление.ВидыТранспортаСообщенийОбмена.WS)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

#КонецОбласти
